app/Http/Controllers/HomeController.php

    public function TeamMembersPage()
    {
        $this->checkVisitor();

        $pages = Page::where('status', 1)->get();
        $page = $this->getPageInfo($pages, 'doctors');

        $teamMembers = TeamMember::where('status', 1)->whenSearch(\request()->search)->latest()->paginate(6);
---
select * from `team_members` where `status` = 1 order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `team_members` where `status` = 1