app/Http/Controllers/HomeController.php

select * from `services` order by `id` desc limit 6
select * from `projects` order by `created_at` desc limit 6
select * from `team_members` order by `id` desc limit 4
select * from `testimonials` where `status` = 1 order by `id` desc limit 3
select * from `blogs` order by `id` desc limit 3
select * from `sliders` order by `id` desc limit 3
select * from `pages` where `status` = 1
---
    public function HomePage()
    {
        $this->checkVisitor();

        $websiteSettings = WebsiteSetting::first();
        $page_filter = $websiteSettings->page_filter != null ? unserialize($websiteSettings->page_filter) : '';
        $services = Service::orderBy('id', 'desc')->limit(6)->get();
        $projects = Project::latest()->take(6)->get();
        $teamMembers = TeamMember::orderBy('id', 'desc')->limit(4)->get();
        $testimonials = Testimonial::where('status', 1)->orderBy('id', 'desc')->limit(3)->get();
        $blogs = Blog::orderBy('id', 'desc')->limit(3)->get();
        $themeName = getThemeName();
        $sliders = Slider::orderBy('id', 'desc')->limit(3)->get();

        $services_count = Service::all()->count();
        $projects_count = Project::all()->count();
        $team_count = TeamMember::all()->count();

        $pages = Page::where('status', 1)->get();

select * from `visitors` where `ip` = '127.0.0.1' and `page` = 'home' order by `created_at` desc limit 1
---
    public function checkVisitor()
    {
        $ip = $_SERVER['REMOTE_ADDR'];
        $page = \Request::segment(1) ?? 'home';

        $visitors = DB::table('visitors')
                ->where('ip', $ip)
                ->where('page', $page)
                ->latest()
                ->first();

select * from `blogs` order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `blogs`
select * from `pages` where `status` = 1
---
    public function blogsPage()
    {
        $this->checkVisitor();

        $blogs = Blog::latest()->paginate(9);
        $pages = Page::where('status', 1)->get();

select * from `blogs` where `id` != '3' order by `created_at` desc limit 4
select * from `pages` where `status` = 1
---
    public function showBlog($id, $title)
    {
        $blog = Blog::findOrFail($id);

        $latest_blogs = Blog::where('id', '!=', $id)
                            ->latest()
                            ->take(4)
                            ->get();
        $pages = Page::where('status', 1)->get();

select * from `projects` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `projects`
select * from `pages` where `status` = 1
---
    public function projectsPage()
    {
        $this->checkVisitor();
        $projects = Project::latest()->paginate(6);
        $pages = Page::where('status', 1)->get();

select * from `pages` where `status` = 1
select * from `team_members` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `team_members`
select * from `categories` order by `created_at` desc
---
    public function TeamMembersPage()
    {
        $this->checkVisitor();

        $pages = Page::where('status', 1)->get();
        $page = $this->getPageInfo($pages, 'doctors');

        $teamMembers = TeamMember::whenSearch(\request()->search)->latest()->paginate(6);
        $categories = Category::latest()->get();

select * from `pages` where `status` = 1
select * from `testimonials` where `status` = 1 order by `created_at` desc limit 2
---
    public function showTeamMember($id, $name)
    {
        $pages = Page::where('status', 1)->get();
        $page = $this->getPageInfo($pages, 'doctors');
        $teamMember = TeamMember::findOrFail($id);
        $testimonials = Testimonial::where('status', 1)->latest()->take(2)->get();